package console

import command.CommandManager

class ConsoleManager(private val commandManager: CommandManager) {

    fun run() {

        print(
            "\n" +
                    "       _..._             __  .--.                        \n" +
                    "    .-'_..._''.         / /\\ |  |                        \n" +
                    "  .' .'      '.\\       / /  '|  |                        \n" +
                    " / .'                 / /  / |  |        .-.          .- \n" +
                    ". '                  / /  /  |  |         \\ \\        / / \n" +
                    "| |                 / /  /   |  |    __    \\ \\      / /  \n" +
                    "| |                / /  /    |  | .:--.'.   \\ \\    / /   \n" +
                    ". '               / /  /     |  |/ |   \\ |   \\ \\  / /    \n" +
                    " \\ '.          . / /  /      |  |`\" __ | |    \\ `  /     \n" +
                    "  '. `._____.-'// /  /       |  | .'.''| |     \\  /      \n" +
                    "    `-.______ //_/  /        |  |/ /   | |_    / /       \n" +
                    "             ` \\ \\ /         |  |\\ \\._,\\ '/|`-' /        \n" +
                    "                --'          '--' `--'  `\"  '..'         "
        )

        println("\n" +
                "    _ __                  __  _                              __  __              __   \n" +
                "   (_) /____  _________ _/ /_(_)   _____     ____ ___  ___  / /_/ /_  ____  ____/ /   \n" +
                "  / / __/ _ \\/ ___/ __ `/ __/ / | / / _ \\   / __ `__ \\/ _ \\/ __/ __ \\/ __ \\/ __  /    \n" +
                " / / /_/  __/ /  / /_/ / /_/ /| |/ /  __/  / / / / / /  __/ /_/ / / / /_/ / /_/ /     \n" +
                "/_/\\__/\\___/_/   \\__,_/\\__/_/ |___/\\___/  /_/ /_/ /_/\\___/\\__/_/ /_/\\____/\\__,_/      \n" +
                "              _________  / /   _____  _____                                           \n" +
                "             / ___/ __ \\/ / | / / _ \\/ ___/                                           \n" +
                "            (__  ) /_/ / /| |/ /  __/ /                                               \n" +
                "           /____/\\____/_/ |___/\\___/_/                                                \n" +
                "                                                                                      \n")


        println("Напишите 'help' для просмотра списка команд")

        while (true) {

            print("console: ")
            val input = readLine()

            if (input!!.isEmpty()) continue

            val args = input.split(" ")

            val cmd = commandManager.getCommand(args[0])

            if (cmd != null) {
                cmd.execute(args)
            } else {
                println("Такой команды нет! Напишите 'help' для вывода списка доступных команд.")
            }

        }
    }

}